* Store_R29
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | Store_R29
Place name                       | Store Glacier
Geographic location              | Central West Greenland
Site type                        | Ice sheet
Data Source                      | Hubbard, Bryn; Christoffersen, Poul; Doyle, Samuel; Chudley, Thomas; Schoonman, Charlotte; Law, Robert; et al. (2020): Supporting data for 'Borehole-based characterization of deep crevasses at a Greenlandic outlet glacier' published in AGU Advances. figshare. Dataset. https://doi.org/10.6084/m9.figshare.13400072.v1
Data DOI                         | 10.6084/m9.figshare.13400072.v2
Science Source                   | Hubbard, B., Christoffersen, P., Doyle, S. H., Chudley, T. R., Bougamont, M. H., Law, R., & Schoonman, C. (2020). Borehole-based characterization of deep crevasses at a Greenlandic outlet glacier.
Science DOI                      | 10.1029/2020AV000291
Date                             | 2018-08
Longitude [°E]                   | -50.05894
Latitude [°N]                    | 70.56359
Location Source                  | S. Doyle email
Depth of top measurement [m]     | 27.0
Depth of bottom measurement [m]  | 949
Ice thickness [m]                | 949
Coverage [% of thickness]        | 97
Ice thickness source             | See science reference
Note                             | Note: Temperature measured in immediately adjacent Boreholes 18b and 18d.
#+end_example


** Temperature

** Thickness

From Doyle (2018), "Ice thickness at S30 was determined to be ∼600 m"

** Location

** Data                                                 :noexport:

#+BEGIN_SRC bash
wget https://figshare.com/ndownloader/files/31161307 -O 31161307.csv
#+END_SRC

#+BEGIN_SRC jupyter-python :exports none
import pandas as pd

df = pd.read_csv('31161307.csv')
# df.to_csv('raw.csv')
df = df.rename(columns = {'Depth (m)':'d', 'T_0 (deg. C)': 't'})
df = df.set_index('d').dropna(how='all')
df['t'].to_csv('data.csv', float_format='%.3f')
#+END_SRC

#+RESULTS:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|      d |      t |
|   26.8 |  -4.92 |
|   31.8 |  -6.04 |
|  101.8 | -12.77 |
|  106.8 |  -13.3 |
|  108.7 | -13.43 |
|  176.8 | -13.58 |
|  181.8 |  -14.2 |
|  183.7 |  -14.3 |
|  251.8 | -15.63 |
|  256.8 | -16.24 |
|  258.7 | -16.72 |
|  326.8 | -18.68 |
|  333.7 | -19.23 |
|  401.8 | -20.54 |
|  408.7 | -20.78 |
|  476.8 | -20.96 |
|  483.7 |  -21.5 |
| 499.35 | -20.48 |
|  551.8 | -21.58 |
|  558.7 | -21.62 |
| 574.35 | -21.66 |
|  633.7 | -21.54 |
| 649.35 | -20.54 |
|  708.7 |  -19.3 |
| 724.35 | -15.63 |
|  783.7 | -17.25 |
| 799.35 | -16.17 |
|  858.7 | -10.75 |
| 874.35 |  -9.37 |
|  933.7 |  -0.95 |
| 949.43 |  -1.05 |
